levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
/**
 *******************************************************************************
 * @file  hc32m423_tmrb.c
 * @brief This file provides firmware functions to manage the TimerB.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-01-01       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_tmrb.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TIMERB TIMERB
 * @brief TimerB Driver Library
 * @{
 */

#if (DDL_TMRB_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMRB_Local_Macros TimerB Local Macros
 * @{
 */

/**
 * @defgroup TMRB_Hardware_Trigger_Condition_Mask TIMERB Hardware Trigger Condition Mask
 * @{
 */
#define TMRB_CCONR_HICP                 (TMRB_CCONR_HICP2 |                    \
                                         TMRB_CCONR_HICP1 |                    \
                                         TMRB_CCONR_HICP0)
#define TMRB_HCONR_HSTA                 (TMRB_HCONR_HSTA2 |                    \
                                         TMRB_HCONR_HSTA1 |                    \
                                         TMRB_HCONR_HSTA0)
#define TMRB_HCONR_HSTP                 (TMRB_HCONR_HSTP2 |                    \
                                         TMRB_HCONR_HSTP1 |                    \
                                         TMRB_HCONR_HSTP0)
#define TMRB_HCONR_HCLE                 (TMRB_HCONR_HCLE6 |                    \
                                         TMRB_HCONR_HCLE5 |                    \
                                         TMRB_HCONR_HCLE2 |                    \
                                         TMRB_HCONR_HCLE1 |                    \
                                         TMRB_HCONR_HCLE0)
#define TMRB_HCUPR_HCUP                 (TMRB_HCUPR_HCUP10 |                   \
                                         TMRB_HCUPR_HCUP9  |                   \
                                         TMRB_HCUPR_HCUP8)
#define TMRB_HCDOR_HCDO                 (TMRB_HCDOR_HCDO10 |                   \
                                         TMRB_HCDOR_HCDO9  |                   \
                                         TMRB_HCDOR_HCDO8)
/**
 * @}
 */

/**
 * @defgroup TMRB_Flag_Mask TIMERB Flag Mask
 * @{
 */
#define TMRB_CNT_FLAG_MASK               (TMRB_FLAG_OVF |                      \
                                          TMRB_FLAG_UDF)

#define TMRB_CMP_FLAG_MASK               (TMRB_FLAG_CMP1 |                     \
                                          TMRB_FLAG_CMP2 |                     \
                                          TMRB_FLAG_CMP3 |                     \
                                          TMRB_FLAG_CMP4 |                     \
                                          TMRB_FLAG_CMP5 |                     \
                                          TMRB_FLAG_CMP6)

#define TMRB_FLAG_MASK                  (TMRB_CNT_FLAG_MASK | TMRB_CMP_FLAG_MASK)
/**
 * @}
 */

/**
 * @defgroup TMRB_Interrupt_Mask TIMERB Interrupt Mask
 * @{
 */
#define TMRB_CNT_INT_MASK               (TMRB_INT_OVF |                        \
                                         TMRB_INT_UDF)

#define TMRB_CMP_INT_MASK               (TMRB_INT_CMP1 |                       \
                                         TMRB_INT_CMP2 |                       \
                                         TMRB_INT_CMP3 |                       \
                                         TMRB_INT_CMP4 |                       \
                                         TMRB_INT_CMP5 |                       \
                                         TMRB_INT_CMP6)

#define TMRB_INT_MASK                   (TMRB_CNT_INT_MASK | TMRB_CMP_INT_MASK)
/**
 * @}
 */

/**
 * @defgroup TMRB_Check_Parameters_Validity TIMERB Check Parameters Validity
 * @{
 */

