levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
#define IS_TMRB_INSTANCE(x)                     (M4_TMRB == (x))

#define IS_TMRB_CH(x)                                                          \
(   (TMRB_CH1 == (x))                           ||                             \
    (TMRB_CH2 == (x))                           ||                             \
    (TMRB_CH3 == (x))                           ||                             \
    (TMRB_CH4 == (x))                           ||                             \
    (TMRB_CH5 == (x))                           ||                             \
    (TMRB_CH6 == (x)))

#define IS_TMRB_PWM_CH(x)                                                      \
(   (TMRB_PWM_CH1 == (x))                       ||                             \
    (TMRB_PWM_CH2 == (x))                       ||                             \
    (TMRB_PWM_CH3 == (x))                       ||                             \
    (TMRB_PWM_CH4 == (x)))

#define IS_TMRB_BUF_CH(x)                                                      \
(   (TMRB_BUF_CH12 == (x))                      ||                             \
    (TMRB_BUF_CH34 == (x))                      ||                             \
    (TMRB_BUF_CH56 == (x)))

#define IS_TMRB_CNT_DIRECTION(x)                                               \
(   (TMRB_CNT_UP == (x))                        ||                             \
    (TMRB_CNT_DOWN == (x)))

#define IS_TMRB_CNT_MODE(x)                                                    \
(   (TMRB_SAWTOOTH_WAVE == (x))                 ||                             \
    (TMRB_TRIANGLE_WAVE == (x)))

#define IS_TMRB_CLOCK_DIV(x)                                                   \
(   (TMRB_CLKDIV_DIV1 == (x))                   ||                             \
    (TMRB_CLKDIV_DIV2 == (x))                   ||                             \
    (TMRB_CLKDIV_DIV4 == (x))                   ||                             \
    (TMRB_CLKDIV_DIV8 == (x))                   ||                             \
    (TMRB_CLKDIV_DIV16 == (x))                  ||                             \
    (TMRB_CLKDIV_DIV32 == (x))                  ||                             \
    (TMRB_CLKDIV_DIV64 == (x))                  ||                             \
    (TMRB_CLKDIV_DIV128 == (x))                 ||                             \
    (TMRB_CLKDIV_DIV256 == (x))                 ||                             \
    (TMRB_CLKDIV_DIV512 == (x))                 ||                             \
    (TMRB_CLKDIV_DIV1024 == (x)))

#define IS_TMRB_OVERFLOW_STATE(x)                                              \
(   (TMRB_OVERFLOW_STOP == (x))                 ||                             \
    (TMRB_OVERFLOW_COUNT == (x)))

#define IS_TMRB_FLAG(x)                                                        \
(   !((x) & (uint16_t)(~TMRB_FLAG_MASK)))


#define IS_TMRB_INT(x)                                                         \
(   !((x) & (uint16_t)(~TMRB_INT_MASK)))

#define IS_TMRB_EVT(x)                                                         \
(   (TMRB_EVT_CMP1 == (x))                      ||                             \
    (TMRB_EVT_CMP2 == (x))                      ||                             \
    (TMRB_EVT_CMP3 == (x))                      ||                             \
    (TMRB_EVT_CMP4 == (x))                      ||                             \
    (TMRB_EVT_CMP5 == (x))                      ||                             \
    (TMRB_EVT_CMP6 == (x)))

#define IS_TMRB_CMP_EVT_STATE(x)                                             \
(   (TMRB_CMP_EVT_ENABLE == (x))                ||                             \
    (TMRB_CMP_EVT_DISABLE == (x)))

#define IS_TMRB_IC_NOISE_FILTER_CLKDIV(x)                                      \
(   (TMRB_IC_NOFICLKDIV_NONE == (x))            ||                             \
    (TMRB_IC_NOFICLKDIV_DIV1 == (x))            ||                             \
    (TMRB_IC_NOFICLKDIV_DIV4 == (x))            ||                             \
    (TMRB_IC_NOFICLKDIV_DIV16 == (x))           ||                             \
    (TMRB_IC_NOFICLKDIV_DIV64 == (x)))

#define IS_TMRB_OC_START_CNT_OUTPUT_POLARITY(x)                                \
(   (TMRB_OC_STARTCNT_OUTPUT_LOW == (x))        ||                             \
    (TMRB_OC_STARTCNT_OUTPUT_HIGH == (x))       ||                             \
    (TMRB_OC_STARTCNT_OUTPUT_HOLD == (x)))

#define IS_TMRB_OC_STOP_CNT_OUTPUT_POLARITY(x)                                 \
(   (TMRB_OC_STOPCNT_OUTPUT_LOW == (x))         ||                             \
    (TMRB_OC_STOPCNT_OUTPUT_HIGH == (x))        ||                             \
    (TMRB_OC_STOPCNT_OUTPUT_HOLD == (x)))

#define IS_TMRB_OC_CMPMATCH_OUTPUT_POLARITY(x)                                 \
(   (TMRB_OC_CMPMATCH_OUTPUT_LOW == (x))        ||                             \
    (TMRB_OC_CMPMATCH_OUTPUT_HIGH == (x))       ||                             \
    (TMRB_OC_CMPMATCH_OUTPUT_HOLD == (x))       ||                             \
    (TMRB_OC_CMPMATCH_OUTPUT_INVERTED == (x)))

#define IS_TMRB_OC_PERIODMATCH_OUTPUT_POLARITY(x)                              \
(   (TMRB_OC_PERIODMATCH_OUTPUT_LOW == (x))     ||                             \
    (TMRB_OC_PERIODMATCH_OUTPUT_HIGH == (x))    ||                             \
    (TMRB_OC_PERIODMATCH_OUTPUT_HOLD == (x))    ||                             \
    (TMRB_OC_PERIODMATCH_OUTPUT_INVERTED == (x)))

#define IS_TMRB_OC_FORCE_OUTPUT_POLARITY(x)                                    \
(   (TMRB_OC_FORCE_OUTPUT_LOW == (x))           ||                             \
    (TMRB_OC_FORCE_OUTPUT_HIGH == (x))          ||                             \
    (TMRB_OC_FORCE_OUTPUT_INVALID == (x)))

#define IS_TMRB_OC_PORT_OUTPUT_STATE(x)                                        \
(   (TMRB_OC_PORT_OUTPUT_ENABLE == (x))         ||                             \
    (TMRB_OC_PORT_OUTPUT_DISABLE == (x)))

#define IS_TMRB_IC_CAPTURE_CONDITION(x) ((!((x) & ((uint16_t)(~TMRB_CCONR_HICP)))) || ((x) == TMRB_IC_INVALID))

#define IS_TMRB_HWSTART_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTA)))) || ((x) == TMRB_HWSTART_INVALID))

#define IS_TMRB_HWSTOP_CONDITION(x)     ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTP)))) || ((x) == TMRB_HWSTOP_INVALID))

