levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
#define IS_TMRB_HWCLEAR_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HCLE)))) || ((x) == TMRB_HWCLEAR_INVALID))

#define IS_TMRB_HWUP_CONDITION(x)       ((!((x) & ((uint16_t)(~TMRB_HCUPR_HCUP)))) || ((x) == TMRB_HWUP_INVALID))

#define IS_TMRB_HWDOWN_CONDITION(x)     ((!((x) & ((uint16_t)(~TMRB_HCDOR_HCDO)))) || ((x) == TMRB_HWDOWN_INVALID))
/**
 * @}
 */

/**
 * @defgroup TMRB_Function_Mode TimerB Function Mode
 * @{
 */
#define TMRB_INPUT_CAPTURE                  (TMRB_CCONR_CAPMDA)     /*!< Capture input function */
#define TMRB_OUTPUT_COMPARE                 ((uint16_t)0x0000U)     /*!< Comare output function */
/**
 * @}
 */

/**
 * @defgroup TMRB_PWM_Channel TIMERB PWM Channel
 * @{
 */
#define TMRB_PWM_CH1                        (TMRB_CH1)
#define TMRB_PWM_CH2                        (TMRB_CH2)
#define TMRB_PWM_CH3                        (TMRB_CH3)
#define TMRB_PWM_CH4                        (TMRB_CH4)
/**
 * @}
 */

/**
 * @defgroup TMRB_BCONRx_Register TIMERB BCONRx Register(x = 1 ~ 3)
 * @brief Get the specified BCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_BCONRx(__TMRBx__, __CH__)      ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->BCONR1)) + ((uint32_t)(__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @defgroup TMRB_CMPARx_Register TIMERB CMPARx Register(x = 1 ~ 6)
 * @brief Get the specified CMPAR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_CMPARx(__TMRBx__, __CH__)      ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->CMPAR1)) + ((uint32_t)(__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @defgroup TMRB_CCONRx_Register TIMERB CCONRx Register(x = 1 ~ 4)
 * @brief Get the specified CCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_CCONRx(__TMRBx__, __CH__)      ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->CCONR1)) + ((uint32_t)(__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @defgroup TMRB_PCONRx_Register TIMERB PCONRx Register(x = 1 ~ 4)
 * @brief Get the specified PCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_PCONRx(__TMRBx__, __CH__)      ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->PCONR1)) + ((uint32_t)(__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static __IO uint32_t* TMRB_TRGSELx(const M4_TMRB_TypeDef *DCUx);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/** 
 * @defgroup TMRB_Global_Functions TimerB Global Functions
 * @{
 */

/**
 * @brief  Initialize TimerB base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_tmrb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcInit = NULL
 */
en_result_t TMRB_Init(M4_TMRB_TypeDef *TMRBx, const stc_tmrb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check pstcInit */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
        DDL_ASSERT(0U != pstcInit->u16PeriodVal);
        DDL_ASSERT(IS_TMRB_CNT_MODE(pstcInit->u16CntMode));
        DDL_ASSERT(IS_TMRB_CLOCK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_TMRB_CNT_DIRECTION(pstcInit->u16CntDir));
        DDL_ASSERT(IS_TMRB_OVERFLOW_STATE(pstcInit->u16OverflowAction));
        DDL_ASSERT(IS_TMRB_HWSTART_CONDITION(pstcInit->u16HwStartCondition));
        DDL_ASSERT(IS_TMRB_HWSTOP_CONDITION(pstcInit->u16HwStopCondition));
        DDL_ASSERT(IS_TMRB_HWCLEAR_CONDITION(pstcInit->u16HwClearCondition));
        DDL_ASSERT(IS_TMRB_HWUP_CONDITION(pstcInit->u16HwUpCondition));
        DDL_ASSERT(IS_TMRB_HWDOWN_CONDITION(pstcInit->u16HwDownCondition));

        WRITE_REG16(TMRBx->CNTER, 0U);
        WRITE_REG16(TMRBx->PERAR, pstcInit->u16PeriodVal);
        MODIFY_REG16(TMRBx->BCSTR,                                             \
                     (TMRB_BCSTR_DIR   | TMRB_BCSTR_MODE |                     \
                      TMRB_BCSTR_CKDIV | TMRB_BCSTR_OVSTP),                    \
                     (pstcInit->u16CntDir | pstcInit->u16CntMode |             \
                      pstcInit->u16ClkDiv | pstcInit->u16OverflowAction));

        /* Set hardware trigger event */
        WRITE_REG16(TMRBx->HCONR,                                              \
                    (pstcInit->u16HwStartCondition |                           \
                     pstcInit->u16HwStopCondition  |                           \
                     pstcInit->u16HwClearCondition));
        WRITE_REG16(TMRBx->HCUPR, pstcInit->u16HwUpCondition);
        WRITE_REG16(TMRBx->HCDOR, pstcInit->u16HwDownCondition);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmrb_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_tmrb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMRB_StructInit(stc_tmrb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcInit)
    {
        pstcInit->u16PeriodVal = 0xFFFFU;
        pstcInit->u16CntDir = TMRB_CNT_UP;
        pstcInit->u16CntMode = TMRB_SAWTOOTH_WAVE;
        pstcInit->u16ClkDiv = TMRB_CLKDIV_DIV1;
        pstcInit->u16OverflowAction = TMRB_OVERFLOW_COUNT;
        pstcInit->u16HwStartCondition = TMRB_HWSTART_INVALID;
        pstcInit->u16HwStopCondition = TMRB_HWSTOP_INVALID;
        pstcInit->u16HwClearCondition = TMRB_HWCLEAR_INVALID;
        pstcInit->u16HwUpCondition = TMRB_HWUP_INVALID;
        pstcInit->u16HwDownCondition = TMRB_HWDOWN_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TMRB_DeInit(M4_TMRB_TypeDef *TMRBx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TMRB_INSTANCE(TMRBx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->CNTER, 0x0000U);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFU);
        WRITE_REG16(TMRBx->BCSTR, 0x0002U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Direction            TimerB count direction
 *         This parameter can be one of the following values:
 *           @arg TMRB_CNT_UP:          TimerB count up
 *           @arg TMRB_CNT_DOWN:        TimerB count down
 * @retval None
 */
void TMRB_SetCntDirection(M4_TMRB_TypeDef *TMRBx, uint16_t u16Direction)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_DIRECTION(u16Direction));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_DIR, u16Direction);
}

/**
 * @brief  Get TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_CNT_UP:          TimerB count up
 *           @arg TMRB_CNT_DOWN:        TimerB count down
 */
uint16_t TMRB_GetCntDirection(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

