levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_DIR);
}

/**
 * @brief  Set TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Mode                 TimerB count mode
 *         This parameter can be one of the following values:
 *           @arg TMRB_TRIANGLE_WAVE:   TimerB triangle wave mode
 *           @arg TMRB_SAWTOOTH_WAVE:   TimerB sawtooth wave mode
 * @retval None
 */
void TMRB_SetCntMode(M4_TMRB_TypeDef *TMRBx, uint16_t u16Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_MODE(u16Mode));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_MODE, u16Mode);
}

/**
 * @brief  Get TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_TRIANGLE_WAVE:   TimerB triangle wave mode
 *           @arg TMRB_SAWTOOTH_WAVE:   TimerB sawtooth wave mode
 */
uint16_t TMRB_GetCntMode(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_MODE);
}

/**
 * @brief  Set TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Div                  TimerB clock division
 *         This parameter can be one of the following values:
 *           @arg TMRB_CLKDIV_DIV1:     HCLK
 *           @arg TMRB_CLKDIV_DIV2:     HCLK/2
 *           @arg TMRB_CLKDIV_DIV4:     HCLK/4
 *           @arg TMRB_CLKDIV_DIV8:     HCLK/8
 *           @arg TMRB_CLKDIV_DIV16:    HCLK/16
 *           @arg TMRB_CLKDIV_DIV32:    HCLK/32
 *           @arg TMRB_CLKDIV_DIV64:    HCLK/64
 *           @arg TMRB_CLKDIV_DIV128:   HCLK/128
 *           @arg TMRB_CLKDIV_DIV256:   HCLK/256
 *           @arg TMRB_CLKDIV_DIV512:   HCLK/512
 *           @arg TMRB_CLKDIV_DIV1024:  HCLK/1024
 * @retval None
 */
void TMRB_SetClkDiv(M4_TMRB_TypeDef *TMRBx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_CLOCK_DIV(u16Div));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_CKDIV, u16Div);
}

/**
 * @brief  Get TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_CLKDIV_DIV1:     HCLK
 *           @arg TMRB_CLKDIV_DIV2:     HCLK/2
 *           @arg TMRB_CLKDIV_DIV4:     HCLK/4
 *           @arg TMRB_CLKDIV_DIV8:     HCLK/8
 *           @arg TMRB_CLKDIV_DIV16:    HCLK/16
 *           @arg TMRB_CLKDIV_DIV32:    HCLK/32
 *           @arg TMRB_CLKDIV_DIV64:    HCLK/64
 *           @arg TMRB_CLKDIV_DIV128:   HCLK/128
 *           @arg TMRB_CLKDIV_DIV256:   HCLK/256
 *           @arg TMRB_CLKDIV_DIV512:   HCLK/512
 *           @arg TMRB_CLKDIV_DIV1024:  HCLK/1024
 */
uint16_t TMRB_GetClkDiv(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_CKDIV);
}

/**
 * @brief  Get TimerB flag status.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TMRB_FLAG_OVF:        Overflow flag
 *           @arg TMRB_FLAG_UDF:        Underflow flag
 *           @arg TMRB_FLAG_CMP1:       Channel1 compare match flag
 *           @arg TMRB_FLAG_CMP2:       Channel2 compare match flag
 *           @arg TMRB_FLAG_CMP3:       Channel3 compare match flag
 *           @arg TMRB_FLAG_CMP4:       Channel4 compare match flag
 *           @arg TMRB_FLAG_CMP5:       Channel5 compare match flag
 *           @arg TMRB_FLAG_CMP6:       Channel6 compare match flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TMRB_GetFlag(const M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    uint16_t u16CntFlag = (u16Flag & TMRB_CNT_FLAG_MASK);
    uint16_t u16CmpFlag = (u16Flag & TMRB_CMP_FLAG_MASK);
    en_flag_status_t enCntStatus = Reset;
    en_flag_status_t enCmpStatus = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_FLAG(u16Flag));

    if (u16CntFlag == READ_REG16_BIT(TMRBx->BCSTR, u16CntFlag))
    {
        enCntStatus = Set;
    }

    if (u16CmpFlag == READ_REG16_BIT(TMRBx->STFLR, u16CmpFlag))
    {
        enCmpStatus = Set;
    }

    return (enCntStatus && enCmpStatus) ? Set : Reset;
}

/**
 * @brief  Clear TimerB flag.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TMRB_FLAG_OVF:        Overflow flag
 *           @arg TMRB_FLAG_UDF:        Underflow flag
 *           @arg TMRB_FLAG_CMP1:       Channel1 compare match flag
 *           @arg TMRB_FLAG_CMP2:       Channel2 compare match flag
 *           @arg TMRB_FLAG_CMP3:       Channel3 compare match flag
 *           @arg TMRB_FLAG_CMP4:       Channel4 compare match flag
 *           @arg TMRB_FLAG_CMP5:       Channel5 compare match flag
 *           @arg TMRB_FLAG_CMP6:       Channel6 compare match flag
 * @retval None
 */
void TMRB_ClearFlag(M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_FLAG(u16Flag));

    if (u16Flag & TMRB_CNT_FLAG_MASK)
    {
        CLEAR_REG16_BIT(TMRBx->BCSTR, (u16Flag & TMRB_CNT_FLAG_MASK));
    }

