levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
    if (u16Flag & TMRB_CMP_FLAG_MASK)
    {
        CLEAR_REG16_BIT(TMRBx->STFLR, (u16Flag & TMRB_CMP_FLAG_MASK));
    }
}

/**
 * @brief  Enable or disable specified TimerB interrupt.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TMRB_INT_OVF:         Overflow interrupt
 *           @arg TMRB_INT_UDF:         Underflow interrupt
 *           @arg TMRB_INT_CMP1:        Channel 1 compare match interrupt
 *           @arg TMRB_INT_CMP2:        Channel 2 compare match interrupt
 *           @arg TMRB_INT_CMP3:        Channel 3 compare match interrupt
 *           @arg TMRB_INT_CMP4:        Channel 4 compare match interrupt
 *           @arg TMRB_INT_CMP5:        Channel 5 compare match interrupt
 *           @arg TMRB_INT_CMP6:        Channel 6 compare match interrupt
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TMRB_IntCmd(M4_TMRB_TypeDef *TMRBx,
                    uint16_t u16IntSource,
                    en_functional_state_t enNewState)
{
    uint16_t u16CntIntSource = (u16IntSource & TMRB_CNT_INT_MASK);
    uint16_t u16CmpIntSource = (u16IntSource & TMRB_CMP_INT_MASK);

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_INT(u16IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG16_BIT(TMRBx->BCSTR, u16CntIntSource);
        SET_REG16_BIT(TMRBx->ICONR, u16CmpIntSource);
    }
    else
    {
        CLEAR_REG16_BIT(TMRBx->BCSTR, u16CntIntSource);
        CLEAR_REG16_BIT(TMRBx->ICONR, u16CmpIntSource);
    }
}

/**
 * @brief  Enable/disable TimerB event function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TMRB_EVT_CMP1:        Channel 1 compare match/capture event
 *           @arg TMRB_EVT_CMP2:        Channel 2 compare match/capture event
 *           @arg TMRB_EVT_CMP3:        Channel 3 compare match/capture event
 *           @arg TMRB_EVT_CMP4:        Channel 4 compare match/capture event
 *           @arg TMRB_EVT_CMP5:        Channel 5 compare match/capture event
 *           @arg TMRB_EVT_CMP6:        Channel 6 compare match/capture event
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TMRB_EventCmd(M4_TMRB_TypeDef *TMRBx,
                            uint32_t u32EvtSource,
                            en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_EVT(u32EvtSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG16(TMRBx->ECONR, u32EvtSource, (Enable == enNewState) ? u32EvtSource : 0U);
}

/**
 * @brief Set the specified event trigger source for TMRB.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param [in] enEventSrc               The trigger external event source source.
 *           @arg This parameter can be any value of @ref en_event_src_t
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: TMRBx is invalid
 */
en_result_t TMRB_SetTriggerSrc(const M4_TMRB_TypeDef *TMRBx,
                                    en_event_src_t enEventSrc)
{
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint32_t *TRGSELx = TMRB_TRGSELx(TMRBx);

    if (NULL != TRGSELx)
    {
        WRITE_REG32(*TRGSELx, ((uint32_t)enEventSrc) & 0x1FFUL);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB hardware trigger counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg @ref TMRB_Hardware_Start_Count_Condition
 *           @arg @ref TMRB_Hardware_Stop_Count_Condition
 *           @arg @ref TMRB_Hardware_Clear_Count_Condition
 * @retval  None
 */
void TMRB_SetHwTriggerCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    WRITE_REG16(TMRBx->HCONR, u16Condition);
}

/**
 * @brief  Set TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_HWSTART_INVALID:             Hardware start is invalid
 *           @arg TMRB_HWSTART_TIMB_T_PWM1_RISING:  Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                  hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TMRB_HWSTART_TIMB_T_PWM1_FALLING: Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                  hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TMRB_HWSTART_EVT:                 Hardware start counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TMRB_SetHwStartCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_HWSTART_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTA, u16Condition);
}

/**
 * @brief  Get TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_HWSTART_INVALID:             Hardware start is invalid
 *           @arg TMRB_HWSTART_TIMB_T_PWM1_RISING:  Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                  hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TMRB_HWSTART_TIMB_T_PWM1_FALLING: Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                  hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TMRB_HWSTART_EVT:                 Hardware start counter by the timer TMRB_HTSSR specified event
 */
uint16_t TMRB_GetHwStartCondition(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTA);
}

/**
 * @brief  Set TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware stop counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_HWSTOP_INVALID:              Hardware stop is invalid
 *           @arg TMRB_HWSTOP_TIMB_T_PWM1_RISING:   Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWSTOP_TIMB_T_PWM1_FALLING:  Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWSTOP_EVT:                  Hardware stop counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TMRB_SetHwStopCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_HWSTOP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTP, u16Condition);
}

/**
 * @brief  Get TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_HWSTOP_INVALID:              Hardware stop is invalid
 *           @arg TMRB_HWSTOP_TIMB_T_PWM1_RISING:   Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWSTOP_TIMB_T_PWM1_FALLING:  Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWSTOP_EVT:                  Hardware stop counter by the timer TMRB_HTSSR specified event
 */
uint16_t TMRB_GetHwStopCondition(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

