levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTP);
}

/**
 * @brief  Set TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware clear counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_HWCLEAR_INVALID:             Hardware clear is invalid
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM1_RISING:  Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1)
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM1_FALLING: Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1)
 *           @arg TMRB_HWCLEAR_EVT:                 Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM3_RISING:  Hardware clear count by rising edge on timer input TIMB_<t>_PWM3 (t = 1)
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM3_FALLING: Hardware clear count by falling edge on timer input TIMB_<t>_PWM3 (t = 1)
 * @retval  None
 */
void TMRB_SetHwClearCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_HWCLEAR_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HCLE, u16Condition);
}

/**
 * @brief  Get TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_HWCLEAR_INVALID:             Hardware clear is invalid
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM1_RISING:  Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM1_FALLING: Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TMRB_HWCLEAR_EVT:                 Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM3_RISING:  Hardware clear count by rising edge on timer input TIMB_<t>_PWM3 (t = 1)
 *           @arg TMRB_HWCLEAR_TIMB_T_PWM3_FALLING: Hardware clear count by falling edge on timer input TIMB_<t>_PWM3 (t = 1)
 */
uint16_t TMRB_GetHwClearCondition(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HCLE);
}

/**
 * @brief  Set TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware up counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_HWUP_INVALID:            Hardware count up is invalid
 *           @arg TMRB_HWUP_TIMB_T_PWM1_RISING: Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWUP_TIMB_T_PWM1_FALLING:Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWUP_EVT:                Hardware count up by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TMRB_SetHwUpCondition(M4_TMRB_TypeDef *TMRBx,
                                    uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_HWUP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCUPR, TMRB_HCUPR_HCUP, u16Condition);
}

/**
 * @brief  Get TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_HWUP_INVALID:            Hardware count up is invalid
 *           @arg TMRB_HWUP_TIMB_T_PWM1_RISING: Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWUP_TIMB_T_PWM1_FALLING:Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWUP_EVT:                Hardware count up by the timer TMRB_HTSSR specified event
 */
uint16_t TMRB_GetHwUpCondition(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCUPR, TMRB_HCUPR_HCUP);
}

/**
 * @brief  Set TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware down counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TMRB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TMRB_SetHwDownCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_HWDOWN_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCDOR, TMRB_HCDOR_HCDO, u16Condition);
}

/**
 * @brief  Get TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TMRB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TMRB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 */
uint16_t TMRB_GetHwDownCondition(const M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCDOR, TMRB_HCDOR_HCDO);
}

/**
 * @brief  Set TimerB triangle wave buffer mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32BufCh                TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_BUF_CH12:        TimerB channel 1
 *           @arg TMRB_BUF_CH34:        TimerB channel 2
 *           @arg TMRB_BUF_CH56:        TimerB channel 3
 * @param  [in] u16Mode                 TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_TRIANGLE_WAVE_BUF_PEAK:  Transfer buffer value when TimerB count peak
 *           @arg TMRB_TRIANGLE_WAVE_BUF_ZERO:  Transfer buffer value when TimerB count zero
 * @retval None
 */
 void TMRB_SetTriangleWaveBufMode(M4_TMRB_TypeDef *TMRBx,
                                    uint32_t u32BufCh,
                                    uint16_t u16Mode)
{
    __IO uint16_t *TMRB_BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_BUF_CH(u32BufCh));
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    TMRB_BCONR = TMRB_BCONRx(TMRBx, u32BufCh);
    MODIFY_REG16(*TMRB_BCONR, (TMRB_BCONR_BSE0 | TMRB_BCONR_BSE1), u16Mode);
}

/**
 * @brief  Set TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 *           @arg TMRB_CH5:             TimerB channel 5
 *           @arg TMRB_CH6:             TimerB channel 6
 * @param  [in] u16Value Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
void TMRB_SetCompare(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32Ch,
                                uint16_t u16Value)
{
    __IO uint16_t *TMRB_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);
    WRITE_REG16(*TMRB_CMPAR, u16Value);
}

/**
 * @brief  Get TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 *           @arg TMRB_CH5:             TimerB channel 5
 *           @arg TMRB_CH6:             TimerB channel 6
 * @retval Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 */
uint16_t TMRB_GetCompare(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));

    TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);
    return READ_REG16(*TMRB_CMPAR);
}

/**
 * @brief  Enable/disable TimerB buffer function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_BUF_CH12:        TimerB channel 1
 *           @arg TMRB_BUF_CH34:        TimerB channel 2
 *           @arg TMRB_BUF_CH56:        TimerB channel 3
 * @param  [in] enNewState              The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TMRB_BufCmd(M4_TMRB_TypeDef *TMRBx,
                        uint32_t u32BufCh,
                        en_functional_state_t enNewState)
{
    __IO uint16_t *TMRB_BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_BUF_CH(u32BufCh));
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    TMRB_BCONR = TMRB_BCONRx(TMRBx, u32BufCh);
    MODIFY_REG16(*TMRB_BCONR, TMRB_BCONR_BEN, (Enable == enNewState) ? TMRB_BCONR_BEN : 0U);
}

/**
 * @brief  Initialize TimerB input capture function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] pstcIcInit              Pointer to a @ref stc_tmrb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcIcInit == NULL
 * @note TimerB channel 5&6 don't support this function.
 */
en_result_t TMRB_IC_Init(M4_TMRB_TypeDef *TMRBx,
                            uint32_t u32Ch,
                            const stc_tmrb_ic_init_t *pstcIcInit)
{
    __IO uint16_t *TMRB_CCONR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcIcInit */
    if (NULL != pstcIcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
        DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
        DDL_ASSERT(IS_TMRB_IC_CAPTURE_CONDITION(pstcIcInit->u16CaptureCondition));
        DDL_ASSERT(IS_TMRB_IC_NOISE_FILTER_CLKDIV(pstcIcInit->u16NoiseFilterClkDiv));

        TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);

