levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
        MODIFY_REG16(*TMRB_CCONR,                                              \
                     (TMRB_CCONR_CAPMDA   | TMRB_CCONR_HICP |                  \
                      TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP),              \
                     (TMRB_INPUT_CAPTURE              |                        \
                      pstcIcInit->u16CaptureCondition |                        \
                      pstcIcInit->u16NoiseFilterClkDiv));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmrb_ic_init_t to default values.
 * @param  [out] pstcIcInit             Pointer to a @ref stc_tmrb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval None
 */
en_result_t TMRB_IC_StructInit(stc_tmrb_ic_init_t *pstcIcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcIcInit)
    {
        pstcIcInit->u16NoiseFilterClkDiv = TMRB_IC_NOFICLKDIV_NONE;
        pstcIcInit->u16CaptureCondition = TMRB_IC_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit input capture.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 * @note TimerB channel 5&6 don't support this function.
 */
en_result_t TMRB_IC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CCONR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TMRB_INSTANCE(TMRBx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

        TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);

        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->PERAR, 0xFFFFU);
        WRITE_REG16(*TMRB_CCONR, 0x0001U);
        WRITE_REG16(TMRBx->HCONR, 0x0000U);
        WRITE_REG16(TMRBx->HCUPR, 0x0000U);
        WRITE_REG16(TMRBx->HCDOR, 0x0000U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] u16Condition            TimerB input capture condition
 *         This parameter can be any composed value of the following values:
 *           @arg TMRB_IC_RISING:       Capture triggered by rising edge on timer input TIMB_<t>_PWMn(t=1,n=1~4)
 *           @arg TMRB_IC_FALLING:      Capture triggered by falling edge on timer input TIMB_<t>_PWMn(t=1,n=1~4)
 *           @arg TMRB_IC_EVT:          Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TMRB_IC_INVALID:      Don't occur capture action
 * @retval None
 * @note TimerB channel 5&6 don't support this function.
 */
void TMRB_IC_SetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint32_t u32Ch,
                                        uint16_t u16Condition)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_IC_CAPTURE_CONDITION(u16Condition));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    MODIFY_REG16(*TMRB_CCONR, TMRB_CCONR_HICP, u16Condition);
}

/**
 * @brief  Get TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval Returned value can be any composed value of the following values:
 *           @arg TMRB_IC_RISING:       Capture triggered by rising edge on timer input TIMB_<t>_PWMn(t=1,n=1~4)
 *           @arg TMRB_IC_FALLING:      Capture triggered by falling edge on timer input TIMB_<t>_PWMn(t=1,n=1~4)
 *           @arg TMRB_IC_EVT:          Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TMRB_IC_INVALID:      Don't occur capture action
 * @note TimerB channel 5&6 don't support this function.
 */
uint16_t TMRB_IC_GetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    return READ_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_HICP);
}

/**
 * @brief  Set TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] u16Div                  TimerB input capture noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TMRB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TMRB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TMRB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TMRB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TMRB_IC_NOFICLKDIV_DIV64:   HCLK/64
 * @note TimerB channel 5&6 don't support this function.
 * @retval None
 */
void TMRB_IC_SetFilterClkDiv(M4_TMRB_TypeDef *TMRBx,
                                    uint32_t u32Ch,
                                    uint16_t u16Div)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_IC_NOISE_FILTER_CLKDIV(u16Div));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    MODIFY_REG16(*TMRB_CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP), u16Div);
}

/**
 * @brief  Get TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TMRB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TMRB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TMRB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TMRB_IC_NOFICLKDIV_DIV64:   HCLK/64
 * @note TimerB channel 5&6 don't support this function.
 */
uint16_t TMRB_IC_GetFilterClkDiv(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    return READ_REG16_BIT(*TMRB_CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP));
}

/**
 * @brief  Enable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval None
 * @note TimerB channel 5&6 don't support this function.
 */
void TMRB_IC_EnableNoiseFilter(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    SET_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Disable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval None
 * @note TimerB channel 5&6 don't support this function.
 */
void TMRB_IC_DisableNoiseFilter(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32Ch);
    CLEAR_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Initialize TimerB output compare function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] pstcOcInit              Pointer to a @ref stc_tmrb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcOcInit == NULL
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
en_result_t TMRB_OC_Init(M4_TMRB_TypeDef *TMRBx,
                            uint32_t u32Ch,
                            const stc_tmrb_oc_init_t *pstcOcInit)
{
    __IO uint16_t *TMRB_PCONR = NULL;
    __IO uint16_t *TMRB_CMPAR = NULL;
    en_result_t enRet = ErrorInvalidParameter;

