levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
    /* Check TMRBx instance and pstcOcInit */
    if (NULL != pstcOcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
        DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
        DDL_ASSERT(IS_TMRB_OC_PORT_OUTPUT_STATE(pstcOcInit->u16PortOutputState));
        DDL_ASSERT(IS_TMRB_OC_START_CNT_OUTPUT_POLARITY(pstcOcInit->u16StartCntOutput));
        DDL_ASSERT(IS_TMRB_OC_STOP_CNT_OUTPUT_POLARITY(pstcOcInit->u16StopCntOutput));
        DDL_ASSERT(IS_TMRB_OC_CMPMATCH_OUTPUT_POLARITY(pstcOcInit->u16CompareMatchOutput));
        DDL_ASSERT(IS_TMRB_OC_PERIODMATCH_OUTPUT_POLARITY(pstcOcInit->u16PeriodMatchOutput));

        TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
        TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);

        WRITE_REG16(*TMRB_CMPAR, pstcOcInit->u16CompareVal);
        WRITE_REG16(*TMRB_PCONR,                                               \
                    (pstcOcInit->u16StartCntOutput     |                       \
                     pstcOcInit->u16StopCntOutput      |                       \
                     pstcOcInit->u16CompareMatchOutput |                       \
                     pstcOcInit->u16PeriodMatchOutput  |                       \
                     pstcOcInit->u16PortOutputState));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmrb_oc_init_t to default values.
 * @param  [out] pstcOcInit             Pointer to a @ref stc_tmrb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcOcInit == NULL
 */
en_result_t TMRB_OC_StructInit(stc_tmrb_oc_init_t *pstcOcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcOcInit)
    {
        pstcOcInit->u16CompareVal = 0xFFFFU;
        pstcOcInit->u16PortOutputState = TMRB_OC_PORT_OUTPUT_DISABLE;
        pstcOcInit->u16StartCntOutput = TMRB_OC_STARTCNT_OUTPUT_LOW;
        pstcOcInit->u16StopCntOutput = TMRB_OC_STOPCNT_OUTPUT_LOW;
        pstcOcInit->u16CompareMatchOutput = TMRB_OC_CMPMATCH_OUTPUT_LOW;
        pstcOcInit->u16PeriodMatchOutput = TMRB_OC_PERIODMATCH_OUTPUT_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit output compare.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
en_result_t TMRB_OC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_PCONR;
    __IO uint16_t *TMRB_CMPAR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TMRB_INSTANCE(TMRBx))
    {
        DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

        TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
        TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);

        /* Configures the registers to reset value. */
        WRITE_REG16(*TMRB_PCONR, 0x0000U);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFU);
        WRITE_REG16(*TMRB_CMPAR, 0xFFFFU);
        WRITE_REG16(TMRBx->BCSTR, 0x0000U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval None
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
void TMRB_OC_EnablePortOutput(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    SET_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Disable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval None
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
void TMRB_OC_DisablePortOutput(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    CLEAR_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity when start count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TMRB_OC_STARTCNT_OUTPUT_LOW:  TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB start count
 *           @arg TMRB_OC_STARTCNT_OUTPUT_HIGH: TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB start count
 *           @arg TMRB_OC_STARTCNT_OUTPUT_HOLD: TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB start count
 * @retval None
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
void TMRB_OC_SetStartCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32Ch,
                                                uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_OC_START_CNT_OUTPUT_POLARITY(u16Polarity));

