levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmrb.c
    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    MODIFY_REG16(*TMRB_PCONR, TMRB_PCONR_CMPC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for compare match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_OC_CMPMATCH_OUTPUT_LOW:      TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB comapre match
 *           @arg TMRB_OC_CMPMATCH_OUTPUT_HIGH:     TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB comapre match
 *           @arg TMRB_OC_CMPMATCH_OUTPUT_HOLD:     TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB comapre match
 *           @arg TMRB_OC_CMPMATCH_OUTPUT_INVERTED: TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB comapre match
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
uint16_t TMRB_OC_GetCmpMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32Ch)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    return READ_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_CMPC);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for period match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_LOW:       TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_HIGH:      TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_HOLD:      TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_INVERTED:  TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB period match
 * @retval None
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
void TMRB_OC_SetPeriodMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32Ch,
                                                    uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_OC_PERIODMATCH_OUTPUT_POLARITY(u16Polarity));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    MODIFY_REG16(*TMRB_PCONR, TMRB_PCONR_PERC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for period match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_LOW:       TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_HIGH:      TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_HOLD:      TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB period match
 *           @arg TMRB_OC_PERIODMATCH_OUTPUT_INVERTED:  TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB period match
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
uint16_t TMRB_OC_GetPeriodMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                        uint32_t u32Ch)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32Ch);
    return READ_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_PERC);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for force.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TMRB_CH1:             TimerB channel 1
 *           @arg TMRB_CH2:             TimerB channel 2
 *           @arg TMRB_CH3:             TimerB channel 3
 *           @arg TMRB_CH4:             TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TMRB_OC_FORCE_OUTPUT_LOW:     Force TIM_<t>_PWMn(t=1,n=1~4) output low level
 *           @arg TMRB_OC_FORCE_OUTPUT_HIGH:    Force TIM_<t>_PWMn(t=1,n=1~4) output high level
 *           @arg TMRB_OC_FORCE_OUTPUT_INVALID: Force invalid
 * @retval None
 * @note TimerB channel 5&6 only output inner signal and don't support TIMB_t_PWMn port function.
 */
void TMRB_OC_SetForceOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32Ch,
                                            uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TMRB_PWM_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_OC_FORCE_OUTPUT_POLARITY(u16Polarity));

